---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentDescription
source: html/99bf89e5-bbd7-12b7-ed41-19e2fd4f487a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentDescription Property

"Description"

## Syntax (C#)
```csharp
public static ForgeTypeId InfrastructureAlignmentDescription { get; }
```